Tekla Open API Reference for Tekla Structures 2025
LevelMark Constructor
Overload List
Name | Description
LevelMark(ViewBase, Point, Point)
 Initializes a new instance of the LevelMark class using the default standard attributes.
LevelMark(ViewBase, Point, Point, LevelMark.LevelMarkAttributes)
 Initializes a new instance of the LevelMark class using the given attributes.
LevelMark(ViewBase, Point, Point, ModelObject)
 Initializes a new instance of the LevelMark class using the given attributes.
LevelMark(ViewBase, Point, Point, PlacingBase)
 Initializes a new instance of the LevelMark class using the given attributes.
LevelMark(ViewBase, Point, Point, ModelObject, LevelMark.LevelMarkAttributes)
 Initializes a new instance of the LevelMark class using the given attributes.
LevelMark(ViewBase, Point, Point, PlacingBase, LevelMark.LevelMarkAttributes)
 Initializes a new instance of the LevelMark class using the given attributes.
LevelMark(ViewBase, Point, Point, PlacingBase, ModelObject)
 Initializes a new instance of the LevelMark class using the given attributes.
LevelMark(ViewBase, Point, Point, PlacingBase, ModelObject, LevelMark.LevelMarkAttributes)
 Initializes a new instance of the LevelMark class using the given attributes.
Top
See Also
Reference
LevelMark Class
Tekla.Structures.Drawing Namespace